dotnet new console - создать новый проект 
dotnet run - запустить проект
Через Console мы обращаемся к системному терминалу

### Пишем приложение которое будет запрашивать данные у пользователя чтобы дальше с ними работать;

Алгоритм

начало
ввести <вывести имя пользователя>
вывести <привет>
вывести <имя пользователя>
конец

команда console.ReadLine(); считывает данные
команда string это строка 
username это переменная
= значит возьми то что справо и положи в то что слево 
команда Console.WriteLine(): выводит все в консоль 

Write(); Вывод в одну строку
WriteLine(); В конце перейти на новую строку
ReadLine(); Считать строку из терминала

на первой стороке пишем Console.WriteLine("Введите ваше имя "); это приглашеник ко вводу
на второй строке string username console.ReadLine(); это строка с перемменной считывающая консолью
на третей строке Console.WriteLine("привет, "); выводит в консоль приветствие
на четвертой строку Console.WriteLine("username "); выводит в консоль приветствие определенного пользователя

### Написать программу сложения двух чисел!

Алгоритм

• Начало                      
• Определить первое число   
• Определить второе число   
• Вывести сумму введенных чисел на экран  
• Конец

int numberA = 5;   // определяем переменную numberA //int numberA целое число А = 5;
int numberB = 4;   // определяем переменную numberB //int numberA целое число B = 4;
int result = numberA + numberB;   // через промежуточную переменную создав контейнер и вложив в него имена переменных
Console.WriteLine (result);   // выведит в консоль результат

// второй вариант 
int numberA = 3;
int numberB = 5;
Console.Writeline (numberA + numberB);

### Показать на экране частное двух чисел

double numberA = 12;   // double позволяет работать с вещественными числами, то есть делить с остатком 
double numberB = 5;
Console.WriteLine(numberA / numberB);

bool // это логический тип данных 

Console.WriteLine // позволяет видеть каждое новое число с новой строки 

### Диапозон случайных чисел 
new Random().Next(1, 10); // Команда создает случайные числа 

int numberA = new Random().Next(1, 10); // 1 2 3 4 ... 9
Console. WriteLine (numberA);  // покажет что за рондомное число 
int numberB = new Random().Next(1, 10);
Console.WriteLine (numberB);  // покажет что за рондомное число 
int result = numberA + numberB;
Console.WriteLine (result);

// Случайности
new Random.Next(min, max) даст случайное целое число от min до mах
[min, max-1] или (min, max) 

### А как поприветствовать пользователя-любимчика?

## Синтаксис: начало

• Начало
• Ввести имя пользователя
• ЕСЛИ имя пользователя совпадает с "Маша" то...
поприветствовать по особенному
• ИНАЧЕ поприветствовать по обычному
• Конец


string username = Console.ReadLine();

if(username == "Маша" )
{
Console.WriteLine("Ура, это же МАША");
}
else
{
Console.Write("Привет, ");
Console.WriteLine (username);
}

Решаем проблему с написанием имени 

string username = Console.ReadLine();

if(username.ToLower() == "маша" ) 
{
Console.WriteLine("Ура, это же МАША");
}
else
{
Console.Write("Привет, ");
Console.WriteLine (username);
}
// username.ToLower() позволяет все символы вашей строки перевести в нижний регистор то есть с какой бы буквы вы не написали маша она встретит вас по особенному 

